In [ ]:
!pip install kagglehub

In [3]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("mashlyn/online-retail-ii-uci")

print("Path to dataset files:", path)

Downloading from https://www.kaggle.com/api/v1/datasets/download/mashlyn/online-retail-ii-uci?dataset_version_number=3...

100%|██████████| 14.5M/14.5M [00:05<00:00, 2.71MB/s]

Extracting files...
Path to dataset files: /Users/parveenkumarsharma/.cache/kagglehub/datasets/mashlyn/online-retail-ii-uci/versions/3

In [4]:

import os

path = "/Users/parveenkumarsharma/.cache/kagglehub/datasets/mashlyn/online-retail-ii-uci/versions/3"
os.listdir(path)

['online_retail_II.csv']

In [66]:
import pandas as pd

file_path = path + "/online_retail_II.csv"
df = pd.read_csv(file_path)


df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [67]:
df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [68]:
df.head()
df.tail()
df.shape

(1067371, 8)

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  object
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 65.1+ MB

In [70]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      4382
Quantity            0
InvoiceDate         0
Price               0
Customer ID    243007
Country             0
dtype: int64

In [71]:
df[df["Description"].isnull()]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
470,489521,21646,NaN,-50,2009-12-01 11:44:00,0.0,NaN,United Kingdom
3114,489655,20683,NaN,-44,2009-12-01 17:26:00,0.0,NaN,United Kingdom
3161,489659,21350,NaN,230,2009-12-01 17:39:00,0.0,NaN,United Kingdom
3731,489781,84292,NaN,17,2009-12-02 11:45:00,0.0,NaN,United Kingdom
4296,489806,18010,NaN,-770,2009-12-02 12:42:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
1060783,581199,84581,NaN,-2,2011-12-07 18:26:00,0.0,NaN,United Kingdom
1060787,581203,23406,NaN,15,2011-12-07 18:31:00,0.0,NaN,United Kingdom
1060793,581209,21620,NaN,6,2011-12-07 18:35:00,0.0,NaN,United Kingdom
1062442,581234,72817,NaN,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
1064015,581408,85175,NaN,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom

In [29]:
df = df.rename(columns={
    "InvoiceNo": "order_id",
    "StockCode": "product_id",
    "Description": "product_name",
    "Quantity": "quantity",
    "InvoiceDate": "order_date",
    "UnitPrice": "unit_price",
    "CustomerID": "customer_id",
    "Country": "country"
})

In [73]:
df.columns = ["order_id",
    "product_id",
    "product_name",
    "quantity",
    "order_date",
    "unit_price",
    "customer_id",
    "country"]

In [74]:
df

,order_id,product_id,product_name,quantity,order_date,unit_price,customer_id,country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [75]:
df["order_date"] = pd.to_datetime(df["order_date"])

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   order_id      1067371 non-null  object
 1   product_id    1067371 non-null  object
 2   product_name  1062989 non-null  object
 3   quantity      1067371 non-null  int64
 4   order_date    1067371 non-null  datetime64[ns]
 5   unit_price    1067371 non-null  float64
 6   customer_id   824364 non-null   float64
 7   country       1067371 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 65.1+ MB

In [77]:
df

,order_id,product_id,product_name,quantity,order_date,unit_price,customer_id,country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [78]:
df = df[~df["order_id"].str.startswith("C")]

In [79]:
df[df["order_id"].str.startswith("C")]

Empty DataFrame
Columns: [order_id, product_id, product_name, quantity, order_date, unit_price, customer_id, country]
Index: []

In [80]:
df["customer_id"].isna().sum()

np.int64(242257)

In [81]:
df["customer_id"].notna().sum()

np.int64(805620)

In [85]:
df.isnull().sum()

order_id        0
product_id      0
product_name    0
quantity        0
order_date      0
unit_price      0
customer_id     0
country         0
dtype: int64

In [84]:
# we will remopve the data 
df = df[df["customer_id"].notna()]

In [86]:
df.isnull().sum()

order_id        0
product_id      0
product_name    0
quantity        0
order_date      0
unit_price      0
customer_id     0
country         0
dtype: int64

In [87]:
df.shape

(805620, 8)

### Remove Non sense Transaction

In [89]:
df = df[(df["quantity"]>0)&(df["unit_price"]>0)]

In [91]:
df.head()

,order_id,product_id,product_name,quantity,order_date,unit_price,customer_id,country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [94]:
##creating the business Feature
df["revenue"] = df["quantity"]*df["unit_price"]
df.head()

,order_id,product_id,product_name,quantity,order_date,unit_price,customer_id,country,revenue
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,100.8
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,30.0

#### checking the Total cusotmer count for each

In [104]:
df.groupby(["customer_id"]).agg(
     Customer_count=("customer_id","count")
).reset_index()

      customer_id  Customer_count
0         12346.0              34
1         12347.0             253
2         12348.0              51
3         12349.0             175
4         12350.0              17
...           ...             ...
5873      18283.0             986
5874      18284.0              28
5875      18285.0              12
5876      18286.0              67
5877      18287.0             155

[5878 rows x 2 columns]

### STEP 5️⃣ Validate Cleaning Impact (ADVANCED)

In [105]:
print("Rows after cleaning:", df.shape[0])

Rows after cleaning: 805549

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805549 entries, 0 to 1067370
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      805549 non-null  object
 1   product_id    805549 non-null  object
 2   product_name  805549 non-null  object
 3   quantity      805549 non-null  int64
 4   order_date    805549 non-null  datetime64[ns]
 5   unit_price    805549 non-null  float64
 6   customer_id   805549 non-null  float64
 7   country       805549 non-null  object
 8   revenue       805549 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 61.5+ MB

In [108]:
df["order_date"] = pd.to_datetime(df["order_date"])

### These will be used in:
#### Cohort analysis
#### Retention
#### Tableau

In [112]:
df["order_date"] = pd.to_datetime(df["order_date"])
df["order_month"] = df["order_date"].dt.to_period("M")
df["order_year"] = df["order_date"].dt.year

In [122]:
# df["order_date"].dt.strftime("%Y-%H")

0          2009-07
1          2009-07
2          2009-07
3          2009-07
4          2009-07
            ...
1067366    2011-12
1067367    2011-12
1067368    2011-12
1067369    2011-12
1067370    2011-12
Name: order_date, Length: 805549, dtype: object

In [124]:
df

,order_id,product_id,product_name,quantity,order_date,unit_price,customer_id,country,revenue,order_month,order_year
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.40,2009-12,2009
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.00,2009-12,2009
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.00,2009-12,2009
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,100.80,2009-12,2009
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,30.00,2009-12,2009
...,...,...,...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France,12.60,2011-12,2011
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France,16.60,2011-12,2011
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France,16.60,2011-12,2011
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France,14.85,2011-12,2011
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France,18.00,2011-12,2011

## Save Cleaned Dataset (Only for Local Use)

In [128]:

df.to_csv("online_retail_cleaned.csv", index = False)

✅ PHASE 1 OUTPUT (WHAT YOU ACHIEVED)

✔ Business understanding
✔ Production-grade cleaning
✔ Feature engineering started
✔ Interview-ready explanations

STEP 2.1️⃣ — Decide SQL Grain (VERY IMPORTANT)
Fact Table Grain

👉 One row = one order line item

This is realistic for:

Revenue analysis

Aggregati

STEP 2.2️⃣ — SQL Schema Design (Production Style)  sql/schema.sql

In [ ]:
# customer_table
create table customers(
    customer_id INT PRIMARY KEY,
    country VARCHAR(50),
);

In [ ]:
# Order Table 
create table orders (
    order_id VARCHAR(50),
    customer_id INT , 
    order_date TIMESTAMP , 
    revenue DECIMAL(10,2),
    PRIMARY key (order_id , customer_id)
) ;

In [134]:
# order items table 
create table order_items(
    order_id varchar(50),
    product_id varchar(50),
    product_name TEXT ,
    quantity INT , 
    unite_price decimal(10,2)
)

I normalized transactional data into customer, order, and item-level tables for scalable analytics.

STEP 2.3️⃣ — Load Cleaned Data into SQL

In [ ]:
copy orders 
from '/path/online_retail_cleaned.csv'
delemiter ','
CSV HEADER ;

STEP 2.4️⃣ — RFM ANALYSIS (CORE SKILL 🔥)
sql/rfm.sql

In [ ]:
# Step 1: Customer Aggregation (CTE)

with cusotmer_metrics as (
    select 
    cusotmer_id , 
    max(order_dates) as Last_purchase_date , 
    count(DISTINCT order_id) as Frequency , 
    sum(revenue) as Monetary 
    from orders 
    group by customer_id
)
select * from customer_metrics ;

This gives:

Recency (raw)
Frequency
Monetary

Step 2: Calculate Recency (Days Since Last Purchase)

In [ ]:
with customer_metrics as
(SELECT
        customer_id,
        MAX(order_date) AS last_purchase_date,
        COUNT(DISTINCT order_id) AS frequency,
        SUM(revenue) AS monetary
    FROM orders
    GROUP BY customer_id),

rfm base as (
    select 
    customer_id , 
    datediff(curdate(), last_purchase_date  ) as recency , 
    frequency ,monetary 
    from customer_metrics
) 
SELECT *
FROM rfm_base;

In [138]:
#RFM

In [ ]:
WITH rfm_base AS (
    SELECT
        customer_id,
        DATEDIFF(CURDATE(), MAX(order_date)) AS recency,
        COUNT(DISTINCT order_id) AS frequency,
        SUM(revenue) AS monetary
    FROM orders
    GROUP BY customer_id
),
rfm_scores AS (
    SELECT
        customer_id,
        NTILE(5) OVER (ORDER BY recency ASC)  AS r_score,
        NTILE(5) OVER (ORDER BY frequency DESC) AS f_score,
        NTILE(5) OVER (ORDER BY monetary DESC)  AS m_score
    FROM rfm_base
)

In [ ]:
WITH rfm_scores AS (
    SELECT
        customer_id,
        NTILE(5) OVER (ORDER BY DATE_PART('day', CURRENT_DATE - MAX(order_date)) ASC) AS r_score,
        NTILE(5) OVER (ORDER BY COUNT(DISTINCT order_id) DESC) AS f_score,
        NTILE(5) OVER (ORDER BY SUM(revenue) DESC) AS m_score
    FROM orders
    GROUP BY customer_id
)
SELECT
    customer_id,
    r_score,
    f_score,
    m_score,
    CASE
        WHEN r_score >= 4 AND f_score >= 4 AND m_score >= 4 THEN 'Champions'
        WHEN r_score >= 3 AND f_score >= 3 THEN 'Loyal Customers'
        WHEN r_score <= 2 AND f_score >= 3 THEN 'At Risk'
        WHEN r_score = 1 THEN 'Churned'
        ELSE 'Others'
    END AS customer_segment
FROM rfm_scores;

In [ ]:
# Output Table for ML & Tableau

In [ ]:
CREATE VIEW customer_rfm AS
SELECT
    customer_id,
    r_score,
    f_score,
    m_score,
    customer_segment
FROM rfm_final;

In [ ]:
COPY orders
FROM '/path/online_retail_cleaned.csv'
DELIMITER ','
CSV HEADER;

WITH customer_metrics AS (
    SELECT
        customer_id,
        MAX(order_date) AS last_purchase_date,
        COUNT(DISTINCT order_id) AS frequency,
        SUM(revenue) AS monetary
    FROM orders
    GROUP BY customer_id
)
SELECT * FROM customer_metrics;

WITH customer_metrics AS (
    SELECT
        customer_id,
        MAX(order_date) AS last_purchase_date,
        COUNT(DISTINCT order_id) AS frequency,
        SUM(revenue) AS monetary
    FROM orders
    GROUP BY customer_id
),
rfm_base AS (
    SELECT
        customer_id,
        DATE_PART('day', CURRENT_DATE - last_purchase_date) AS recency,
        frequency,
        monetary
    FROM customer_metrics
)
SELECT * FROM rfm_base;

WITH rfm_base AS (
    SELECT
        customer_id,
        DATE_PART('day', CURRENT_DATE - MAX(order_date)) AS recency,
        COUNT(DISTINCT order_id) AS frequency,
        SUM(revenue) AS monetary
    FROM orders
    GROUP BY customer_id
),
rfm_scores AS (
    SELECT
        customer_id,
        NTILE(5) OVER (ORDER BY recency ASC) AS r_score,
        NTILE(5) OVER (ORDER BY frequency DESC) AS f_score,
        NTILE(5) OVER (ORDER BY monetary DESC) AS m_score
    FROM rfm_base
)
SELECT * FROM rfm_scores;


WITH rfm_scores AS (
    SELECT
        customer_id,
        NTILE(5) OVER (ORDER BY DATE_PART('day', CURRENT_DATE - MAX(order_date)) ASC) AS r_score,
        NTILE(5) OVER (ORDER BY COUNT(DISTINCT order_id) DESC) AS f_score,
        NTILE(5) OVER (ORDER BY SUM(revenue) DESC) AS m_score
    FROM orders
    GROUP BY customer_id
)
SELECT
    customer_id,
    r_score,
    f_score,
    m_score,
    CASE
        WHEN r_score >= 4 AND f_score >= 4 AND m_score >= 4 THEN 'Champions'
        WHEN r_score >= 3 AND f_score >= 3 THEN 'Loyal Customers'
        WHEN r_score <= 2 AND f_score >= 3 THEN 'At Risk'
        WHEN r_score = 1 THEN 'Churned'
        ELSE 'Others'
    END AS customer_segment
FROM rfm_scores;

CREATE VIEW customer_rfm AS
SELECT
    customer_id,
    r_score,
    f_score,
    m_score,
    customer_segment
FROM rfm_final;

✅ PHASE 2 OUTPUT (VERY STRONG)

✔ Normalized SQL schema
✔ Advanced CTEs & window functions
✔ RFM scoring (industry standard)
✔ Business-ready customer segments

PYTHON PHASE — ADVANCED EDA + STATISTICS